{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "e9cca778",
   "metadata": {},
   "source": [
    "# Northwind Trades ® - Enhancing Product Recommendations and Warehouse Efficiency through Data-Driven Analytics\n",
    "## Part 5: Neo4j Triangle Algorithm"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "30120b3e",
   "metadata": {},
   "source": [
    "### Included Modules, Packages, and Supporting Functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "2a567c45",
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "import pandas as pd\n",
    "\n",
    "import psycopg2\n",
    "from IPython.display import display\n",
    "import neo4j\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4b2a9f2f",
   "metadata": {},
   "source": [
    "### Connect to PostgreSQL"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "4bac1f6f",
   "metadata": {},
   "outputs": [],
   "source": [
    "connection = psycopg2.connect(\n",
    "    user=\"postgres\",\n",
    "    password=\"ucb\",\n",
    "    host=\"postgres\",\n",
    "    port=\"5432\",\n",
    "    database=\"postgres\"\n",
    ")\n",
    "cursor = connection.cursor()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "43a8f0d9",
   "metadata": {},
   "source": [
    "### Connect to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "aad74abf",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"neo4j://neo4j:7687\", auth=(\"neo4j\", \"ucb_mids_w205\"))\n",
    "session = driver.session(database=\"neo4j\")\n",
    "\n",
    "# Wipe out existing Neo4j database\n",
    "def my_neo4j_wipe_out_database():\n",
    "    \"Wipe out database by deleting all nodes and relationships\"\n",
    "    session.run(\"MATCH (n)-[r]->() DELETE r\")\n",
    "    session.run(\"MATCH (n) DELETE n\")\n",
    "\n",
    "my_neo4j_wipe_out_database()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "06275e37",
   "metadata": {},
   "source": [
    "### Create product nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "5ceecb64",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f213cd817f0>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cursor.execute(\"SELECT product_id, product_name FROM products\")\n",
    "products = cursor.fetchall()\n",
    "products_data = [{\"id\": row[0], \"name\": row[1]} for row in products]\n",
    "\n",
    "query_create_nodes = \"\"\"\n",
    "UNWIND $products AS product\n",
    "CREATE (:Product {product_id: product.id, name: product.name});\n",
    "\"\"\"\n",
    "session.run(query_create_nodes, products=products_data)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2e152d01",
   "metadata": {},
   "source": [
    "### Generate co-purchase pairs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a47aad18",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f213e499c10>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "co_purchase_sql = \"\"\"\n",
    "SELECT od1.product_id, od2.product_id\n",
    "FROM order_details od1\n",
    "JOIN order_details od2\n",
    "  ON od1.order_id = od2.order_id AND od1.product_id < od2.product_id\n",
    "\"\"\"\n",
    "cursor.execute(co_purchase_sql)\n",
    "co_purchase_rows = cursor.fetchall()\n",
    "co_purchase_pairs = [{\"pair\": [row[0], row[1]]} for row in co_purchase_rows]\n",
    "\n",
    "# Insert pairs into Neo4j\n",
    "query_create_relationships = \"\"\"\n",
    "UNWIND $pairs AS row\n",
    "MATCH (p1:Product {product_id: row.pair[0]})\n",
    "MATCH (p2:Product {product_id: row.pair[1]})\n",
    "MERGE (p1)-[:CO_PURCHASED]->(p2)\n",
    "\"\"\"\n",
    "session.run(query_create_relationships, pairs=co_purchase_pairs)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8bb3c0a5",
   "metadata": {},
   "source": [
    "### Create graph projection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "917d9fd2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x7f213cd81be0>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Drop existing graph projection, if any\n",
    "session.run(\"CALL gds.graph.drop('product_graph', false) YIELD graphName\")\n",
    "\n",
    "# Create new projection\n",
    "session.run(\"\"\"\n",
    "CALL gds.graph.project(\n",
    "    'product_graph',\n",
    "    'Product',\n",
    "    {\n",
    "        CO_PURCHASED: {\n",
    "            type: 'CO_PURCHASED',\n",
    "            orientation: 'UNDIRECTED'\n",
    "        }\n",
    "    }\n",
    ")\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f18992a0",
   "metadata": {},
   "source": [
    "### Implement triangle count algorithm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "51ec1c02",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "    product_id                     product_name  triangle_count\n",
      "0           60                Camembert Pierrot            1074\n",
      "1           41  Jack's New England Clam Chowder            1050\n",
      "2            2                            Chang            1039\n",
      "3           77  Original Frankfurter grüne Soße            1019\n",
      "4           13                            Konbu            1001\n",
      "..         ...                              ...             ...\n",
      "72          37                       Gravad lax              83\n",
      "73           5           Chef Anton's Gumbo Mix              76\n",
      "74          15                     Genen Shouyu              49\n",
      "75           9                  Mishi Kobe Niku              38\n",
      "76          48                        Chocolade              22\n",
      "\n",
      "[77 rows x 3 columns]\n"
     ]
    }
   ],
   "source": [
    "query_triangle_count_write = \"\"\"\n",
    "CALL gds.triangleCount.write('product_graph', {\n",
    "  writeProperty: 'triangleCount'\n",
    "})\n",
    "YIELD nodePropertiesWritten\n",
    "\"\"\"\n",
    "session.run(query_triangle_count_write)\n",
    "\n",
    "# Optional: Also fetch triangle counts into Python for name lookups\n",
    "query_triangle_count_stream = \"\"\"\n",
    "CALL gds.triangleCount.stream('product_graph')\n",
    "YIELD nodeId, triangleCount\n",
    "RETURN gds.util.asNode(nodeId).product_id AS product_id,\n",
    "       gds.util.asNode(nodeId).name AS product_name,\n",
    "       triangleCount\n",
    "ORDER BY triangleCount DESC, product_name\n",
    "\"\"\"\n",
    "result = session.run(query_triangle_count_stream)\n",
    "\n",
    "triangle_counts = pd.DataFrame([\n",
    "    {\n",
    "        \"product_id\": row[\"product_id\"],\n",
    "        \"product_name\": row[\"product_name\"],\n",
    "        \"triangle_count\": row[\"triangleCount\"]\n",
    "    }\n",
    "    for row in result\n",
    "])\n",
    "\n",
    "print(triangle_counts)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d7077f06",
   "metadata": {},
   "source": [
    "### Recommender System\n",
    "The following code implements a digital shopping cart with a simplified recommender system. The recommender system uses the Neo4j co-purchase edges to recommend highly co-purchased products. When the user is finished, a receipt is printed with the total cost."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "c8cd4ee0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "🛍️ Welcome to the Northwind Smart Cart!\n",
      "\n",
      "📦 Available Products:\n",
      "1: Chai\n",
      "2: Chang\n",
      "3: Aniseed Syrup\n",
      "4: Chef Anton's Cajun Seasoning\n",
      "5: Chef Anton's Gumbo Mix\n",
      "6: Grandma's Boysenberry Spread\n",
      "7: Uncle Bob's Organic Dried Pears\n",
      "8: Northwoods Cranberry Sauce\n",
      "9: Mishi Kobe Niku\n",
      "10: Ikura\n",
      "11: Queso Cabrales\n",
      "12: Queso Manchego La Pastora\n",
      "13: Konbu\n",
      "14: Tofu\n",
      "15: Genen Shouyu\n",
      "16: Pavlova\n",
      "17: Alice Mutton\n",
      "18: Carnarvon Tigers\n",
      "19: Teatime Chocolate Biscuits\n",
      "20: Sir Rodney's Marmalade\n",
      "21: Sir Rodney's Scones\n",
      "22: Gustaf's Knäckebröd\n",
      "23: Tunnbröd\n",
      "24: Guaraná Fantástica\n",
      "25: NuNuCa Nuß-Nougat-Creme\n",
      "26: Gumbär Gummibärchen\n",
      "27: Schoggi Schokolade\n",
      "28: Rössle Sauerkraut\n",
      "29: Thüringer Rostbratwurst\n",
      "30: Nord-Ost Matjeshering\n",
      "31: Gorgonzola Telino\n",
      "32: Mascarpone Fabioli\n",
      "33: Geitost\n",
      "34: Sasquatch Ale\n",
      "35: Steeleye Stout\n",
      "36: Inlagd Sill\n",
      "37: Gravad lax\n",
      "38: Côte de Blaye\n",
      "39: Chartreuse verte\n",
      "40: Boston Crab Meat\n",
      "41: Jack's New England Clam Chowder\n",
      "42: Singaporean Hokkien Fried Mee\n",
      "43: Ipoh Coffee\n",
      "44: Gula Malacca\n",
      "45: Rogede sild\n",
      "46: Spegesild\n",
      "47: Zaanse koeken\n",
      "48: Chocolade\n",
      "49: Maxilaku\n",
      "50: Valkoinen suklaa\n",
      "51: Manjimup Dried Apples\n",
      "52: Filo Mix\n",
      "53: Perth Pasties\n",
      "54: Tourtière\n",
      "55: Pâté chinois\n",
      "56: Gnocchi di nonna Alice\n",
      "57: Ravioli Angelo\n",
      "58: Escargots de Bourgogne\n",
      "59: Raclette Courdavault\n",
      "60: Camembert Pierrot\n",
      "61: Sirop d'érable\n",
      "62: Tarte au sucre\n",
      "63: Vegie-spread\n",
      "64: Wimmers gute Semmelknödel\n",
      "65: Louisiana Fiery Hot Pepper Sauce\n",
      "66: Louisiana Hot Spiced Okra\n",
      "67: Laughing Lumberjack Lager\n",
      "68: Scottish Longbreads\n",
      "69: Gudbrandsdalsost\n",
      "70: Outback Lager\n",
      "71: Flotemysost\n",
      "72: Mozzarella di Giovanni\n",
      "73: Röd Kaviar\n",
      "74: Longlife Tofu\n",
      "75: Rhönbräu Klosterbier\n",
      "76: Lakkalikööri\n",
      "77: Original Frankfurter grüne Soße\n",
      "\n",
      "🛒 Your cart is empty.\n",
      "\n",
      "Enter product ID to add to cart (or 'done' to checkout): 3\n",
      "\n",
      "📦 Available Products:\n",
      "1: Chai\n",
      "2: Chang\n",
      "3: Aniseed Syrup\n",
      "4: Chef Anton's Cajun Seasoning\n",
      "5: Chef Anton's Gumbo Mix\n",
      "6: Grandma's Boysenberry Spread\n",
      "7: Uncle Bob's Organic Dried Pears\n",
      "8: Northwoods Cranberry Sauce\n",
      "9: Mishi Kobe Niku\n",
      "10: Ikura\n",
      "11: Queso Cabrales\n",
      "12: Queso Manchego La Pastora\n",
      "13: Konbu\n",
      "14: Tofu\n",
      "15: Genen Shouyu\n",
      "16: Pavlova\n",
      "17: Alice Mutton\n",
      "18: Carnarvon Tigers\n",
      "19: Teatime Chocolate Biscuits\n",
      "20: Sir Rodney's Marmalade\n",
      "21: Sir Rodney's Scones\n",
      "22: Gustaf's Knäckebröd\n",
      "23: Tunnbröd\n",
      "24: Guaraná Fantástica\n",
      "25: NuNuCa Nuß-Nougat-Creme\n",
      "26: Gumbär Gummibärchen\n",
      "27: Schoggi Schokolade\n",
      "28: Rössle Sauerkraut\n",
      "29: Thüringer Rostbratwurst\n",
      "30: Nord-Ost Matjeshering\n",
      "31: Gorgonzola Telino\n",
      "32: Mascarpone Fabioli\n",
      "33: Geitost\n",
      "34: Sasquatch Ale\n",
      "35: Steeleye Stout\n",
      "36: Inlagd Sill\n",
      "37: Gravad lax\n",
      "38: Côte de Blaye\n",
      "39: Chartreuse verte\n",
      "40: Boston Crab Meat\n",
      "41: Jack's New England Clam Chowder\n",
      "42: Singaporean Hokkien Fried Mee\n",
      "43: Ipoh Coffee\n",
      "44: Gula Malacca\n",
      "45: Rogede sild\n",
      "46: Spegesild\n",
      "47: Zaanse koeken\n",
      "48: Chocolade\n",
      "49: Maxilaku\n",
      "50: Valkoinen suklaa\n",
      "51: Manjimup Dried Apples\n",
      "52: Filo Mix\n",
      "53: Perth Pasties\n",
      "54: Tourtière\n",
      "55: Pâté chinois\n",
      "56: Gnocchi di nonna Alice\n",
      "57: Ravioli Angelo\n",
      "58: Escargots de Bourgogne\n",
      "59: Raclette Courdavault\n",
      "60: Camembert Pierrot\n",
      "61: Sirop d'érable\n",
      "62: Tarte au sucre\n",
      "63: Vegie-spread\n",
      "64: Wimmers gute Semmelknödel\n",
      "65: Louisiana Fiery Hot Pepper Sauce\n",
      "66: Louisiana Hot Spiced Okra\n",
      "67: Laughing Lumberjack Lager\n",
      "68: Scottish Longbreads\n",
      "69: Gudbrandsdalsost\n",
      "70: Outback Lager\n",
      "71: Flotemysost\n",
      "72: Mozzarella di Giovanni\n",
      "73: Röd Kaviar\n",
      "74: Longlife Tofu\n",
      "75: Rhönbräu Klosterbier\n",
      "76: Lakkalikööri\n",
      "77: Original Frankfurter grüne Soße\n",
      "\n",
      "🛒 Your cart:\n",
      "----------------------------------------\n",
      "Item                              Price\n",
      "----------------------------------------\n",
      "Aniseed Syrup                     $9.50\n",
      "----------------------------------------\n",
      "Cart Total                        $9.50\n",
      "\n",
      "🧠 Based on your cart, you might also like:\n",
      "60: Camembert Pierrot (Triangle Count: 1074)\n",
      "41: Jack's New England Clam Chowder (Triangle Count: 1050)\n",
      "77: Original Frankfurter grüne Soße (Triangle Count: 1019)\n",
      "\n",
      "Enter product ID to add to cart (or 'done' to checkout): 60\n",
      "\n",
      "📦 Available Products:\n",
      "1: Chai\n",
      "2: Chang\n",
      "3: Aniseed Syrup\n",
      "4: Chef Anton's Cajun Seasoning\n",
      "5: Chef Anton's Gumbo Mix\n",
      "6: Grandma's Boysenberry Spread\n",
      "7: Uncle Bob's Organic Dried Pears\n",
      "8: Northwoods Cranberry Sauce\n",
      "9: Mishi Kobe Niku\n",
      "10: Ikura\n",
      "11: Queso Cabrales\n",
      "12: Queso Manchego La Pastora\n",
      "13: Konbu\n",
      "14: Tofu\n",
      "15: Genen Shouyu\n",
      "16: Pavlova\n",
      "17: Alice Mutton\n",
      "18: Carnarvon Tigers\n",
      "19: Teatime Chocolate Biscuits\n",
      "20: Sir Rodney's Marmalade\n",
      "21: Sir Rodney's Scones\n",
      "22: Gustaf's Knäckebröd\n",
      "23: Tunnbröd\n",
      "24: Guaraná Fantástica\n",
      "25: NuNuCa Nuß-Nougat-Creme\n",
      "26: Gumbär Gummibärchen\n",
      "27: Schoggi Schokolade\n",
      "28: Rössle Sauerkraut\n",
      "29: Thüringer Rostbratwurst\n",
      "30: Nord-Ost Matjeshering\n",
      "31: Gorgonzola Telino\n",
      "32: Mascarpone Fabioli\n",
      "33: Geitost\n",
      "34: Sasquatch Ale\n",
      "35: Steeleye Stout\n",
      "36: Inlagd Sill\n",
      "37: Gravad lax\n",
      "38: Côte de Blaye\n",
      "39: Chartreuse verte\n",
      "40: Boston Crab Meat\n",
      "41: Jack's New England Clam Chowder\n",
      "42: Singaporean Hokkien Fried Mee\n",
      "43: Ipoh Coffee\n",
      "44: Gula Malacca\n",
      "45: Rogede sild\n",
      "46: Spegesild\n",
      "47: Zaanse koeken\n",
      "48: Chocolade\n",
      "49: Maxilaku\n",
      "50: Valkoinen suklaa\n",
      "51: Manjimup Dried Apples\n",
      "52: Filo Mix\n",
      "53: Perth Pasties\n",
      "54: Tourtière\n",
      "55: Pâté chinois\n",
      "56: Gnocchi di nonna Alice\n",
      "57: Ravioli Angelo\n",
      "58: Escargots de Bourgogne\n",
      "59: Raclette Courdavault\n",
      "60: Camembert Pierrot\n",
      "61: Sirop d'érable\n",
      "62: Tarte au sucre\n",
      "63: Vegie-spread\n",
      "64: Wimmers gute Semmelknödel\n",
      "65: Louisiana Fiery Hot Pepper Sauce\n",
      "66: Louisiana Hot Spiced Okra\n",
      "67: Laughing Lumberjack Lager\n",
      "68: Scottish Longbreads\n",
      "69: Gudbrandsdalsost\n",
      "70: Outback Lager\n",
      "71: Flotemysost\n",
      "72: Mozzarella di Giovanni\n",
      "73: Röd Kaviar\n",
      "74: Longlife Tofu\n",
      "75: Rhönbräu Klosterbier\n",
      "76: Lakkalikööri\n",
      "77: Original Frankfurter grüne Soße\n",
      "\n",
      "🛒 Your cart:\n",
      "----------------------------------------\n",
      "Item                              Price\n",
      "----------------------------------------\n",
      "Aniseed Syrup                     $9.50\n",
      "Camembert Pierrot                $32.13\n",
      "----------------------------------------\n",
      "Cart Total                       $41.63\n",
      "\n",
      "🧠 Based on your cart, you might also like:\n",
      "41: Jack's New England Clam Chowder (Triangle Count: 1050)\n",
      "77: Original Frankfurter grüne Soße (Triangle Count: 1019)\n",
      "77: Original Frankfurter grüne Soße (Triangle Count: 1019)\n",
      "\n",
      "Enter product ID to add to cart (or 'done' to checkout): done\n",
      "\n",
      "🧾 Final Cart:\n",
      "----------------------------------------\n",
      "Item                              Price\n",
      "----------------------------------------\n",
      "Aniseed Syrup                     $9.50\n",
      "Camembert Pierrot                $32.13\n",
      "----------------------------------------\n",
      "TOTAL                            $41.63\n",
      "✅ Thanks for shopping with us!\n",
      "\n"
     ]
    }
   ],
   "source": [
    "connection.rollback()\n",
    "\n",
    "cursor.execute(\"\"\"\n",
    "    SELECT product_id, ROUND(AVG(unit_price::numeric), 2) AS avg_price\n",
    "    FROM order_details\n",
    "    GROUP BY product_id\n",
    "\"\"\")\n",
    "price_lookup = dict(cursor.fetchall())\n",
    "\n",
    "# Get product name from triangle df\n",
    "def get_product_names(cart_ids):\n",
    "    return list(\n",
    "        triangle_counts[triangle_counts[\"product_id\"].isin(cart_ids)][\"product_name\"]\n",
    "    )\n",
    "\n",
    "# List all Northwinds products and product ids\n",
    "def list_products():\n",
    "    print(\"\\n📦 Available Products:\")\n",
    "    query = \"MATCH (p:Product) RETURN p.product_id AS id, p.name AS name ORDER BY id\"\n",
    "    for row in session.run(query):\n",
    "        print(f\"{row['id']}: {row['name']}\")\n",
    "\n",
    "# Compute total\n",
    "def cart_total(cart):\n",
    "    return round(sum(price_lookup[item] for item in cart), 2)\n",
    "\n",
    "# Display receipt with final selection and total price\n",
    "def receipt(cart):\n",
    "    print(\"\\n🧾 Final Cart:\")\n",
    "    print(\"-\" * 40)\n",
    "    print(f\"{'Item':30} {'Price':>8}\")\n",
    "    print(\"-\" * 40)\n",
    "    for item in cart:\n",
    "        name = get_product_names([item])[0]\n",
    "        price = price_lookup[item]\n",
    "        print(f\"{name.ljust(30)} {f'${price:.2f}':>8}\")\n",
    "    print(\"-\" * 40)\n",
    "    print(f\"{'TOTAL':30} {f'${cart_total(cart):.2f}':>8}\")\n",
    "    print(\"✅ Thanks for shopping with us!\\n\")\n",
    "\n",
    "# Finds all co-purchased products to products in cart\n",
    "# Recommends products with highest triangle counts\n",
    "def recommend_products(cart):\n",
    "    if not cart:\n",
    "        return\n",
    "\n",
    "    print(\"\\n🧠 Based on your cart, you might also like:\")\n",
    "\n",
    "    query = \"\"\"\n",
    "    MATCH (p:Product)-[:CO_PURCHASED]->(rec:Product)\n",
    "    WHERE p.product_id IN $cart AND NOT rec.product_id IN $cart\n",
    "    RETURN rec.product_id AS id, rec.name AS name, rec.triangleCount AS tc\n",
    "    ORDER BY tc DESC, name\n",
    "    LIMIT 3\n",
    "    \"\"\"\n",
    "    results = session.run(query, cart=cart)\n",
    "    for row in results:\n",
    "        print(f\"{row['id']}: {row['name']} (Triangle Count: {row['tc']})\")\n",
    "\n",
    "def main():\n",
    "    cart = []\n",
    "    print(\"🛍️ Welcome to the Northwind Smart Cart!\")\n",
    "\n",
    "    while True:\n",
    "        list_products()\n",
    "\n",
    "        if cart:\n",
    "            print(\"\\n🛒 Your cart:\")\n",
    "            print(\"-\" * 40)\n",
    "            print(f\"{'Item':30} {'Price':>8}\")\n",
    "            print(\"-\" * 40)\n",
    "            for item in cart:\n",
    "                name = get_product_names([item])[0]\n",
    "                price = price_lookup[item]\n",
    "                print(f\"{name.ljust(30)} {f'${price:.2f}':>8}\")\n",
    "            print(\"-\" * 40)\n",
    "            print(f\"{'Cart Total':30} {f'${cart_total(cart):.2f}':>8}\")\n",
    "        else:\n",
    "            print(\"\\n🛒 Your cart is empty.\")\n",
    "\n",
    "        if cart:\n",
    "            recommend_products(cart)\n",
    "\n",
    "        choice = input(\"\\nEnter product ID to add to cart (or 'done' to checkout): \").strip()\n",
    "        if choice.lower() == \"done\":\n",
    "            break\n",
    "        elif int(choice) in range(1,78):\n",
    "            cart.append(int(choice))\n",
    "        else:\n",
    "            print(\"❌ Invalid input. Please enter a valid number or 'done'.\")\n",
    "\n",
    "    receipt(cart)\n",
    "\n",
    "main()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "6ec882cd",
   "metadata": {},
   "outputs": [],
   "source": [
    "session.close()\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5c751ba8",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
